interface problems {
  number: String;
  problem: String;
  ex: Array<String>;
  videoid?: String;
}

export const problems: Array<problems> = [
  {
    number: "첫번째",
    problem: "재생된 곡의 제목은?",
    ex: [
      "ド屑 (개쓰레기)",
      "死神 (사신)",
      "エンヴィーベイビー (엔비 베이비)",
      "酔いどれ知らず (취한줄도 모르고)",
    ],
    videoid: "_FTJ3XaYm2M",
  },
  {
    number: "두번째",
    problem: "재생된 곡의 제목은?",
    ex: [
      "身体は正直だって言ってんの (몸은 솔직하다고 말하는 거야)",
      "ド屑 (개쓰레기)",
      "いかないで (가지마)",
      "ねむるまち(잠이 드는 거리)",
    ],
    videoid: "z_wOAjxjelA",
  },
  {
    number: "세번째",
    problem: "재생된 곡은 애니메이션 OST이다. 해당 애니메이션 이름은?",
    ex: [
      "스즈메의 문단속",
      "쏘아올린 불꽃, 밑에서 볼까? 옆에서 볼까?",
      "너의 이름은",
      "시간을 달리는 소녀",
    ],
    videoid: "cAvukd7LRF0",
  },
  {
    number: "네번째",
    problem: "다음 재생된 곡과 관련된 것으로 틀린 것은?",
    ex: [
      "유튜브 노래 티어표 방송에서 C에서 D로 내리려다 말았다.",
      "원곡은 팝송이다.",
      "해당 영상에서 류님은 욕조 안에 있다.",
      "22년 8월에 나온 커버곡이다.",
    ],
    videoid: "rROoaC8y-Gw",
  },
  {
    number: "다섯번째",
    problem: "다음 재생된 곡과 관련된 것으로 맞는 것은?",
    ex: [
      "한국어 최초 커버이다.",
      "한국어 번역은 하루나비님이 하셨다.",
      "해당 곡은 kuroi채널로 올라왔다.",
      "영상 속 류님 손엔 술잔이 들려있다.",
    ],
    videoid: "tRO1wsDn488",
  },
  {
    number: "여섯번째",
    problem: "다음 재생된 곡과 관련된 것으로 틀린 것은?",
    ex: [
      "원곡 가사 그대로 불렀다.",
      "영상 코멘트에 '너만 알고 있어 내꺼 하는 법'이라고 적혀있다.",
      "류님은 방송에서 유튜브 영상 중 퀄리티가 제일 좋은 영상이라고 말했다.",
      "토끼귀가 달린 모자를 쓰고 있다.",
    ],
    videoid: "mcJreu1BsBo",
  },
  {
    number: "일곱번째",
    problem: "재생된 곡과 관련한 정보로 틀린 것은?",
    ex: [
      "류님 유튜브 J POP cover channel 이라는 재생목록에 포함되어 있다.",
      "류님은 방송에서 해당 곡의 귀여운 면을 잘 못살렸다고 말했다.",
      "노래 영상엔 상어, 고슴도치, 고양이, 미츠루가 모두 나온다.",
      "해당 곡은 어린이날에 공개되었다.",
    ],
    videoid: "1APGXTiPp_8",
  },
  {
    number: "여덟번째",
    problem: "재생된 노래와 관련한 게임에서 류님이 사용하거나 사용했던 닉네임이 아닌 것은?",
    ex: ["낭만갈매기", "멋진납작만두임", "XxIL", "멋진김치만두임"],
    videoid: "0qM7RNlZ4o0",
  },

  {
    number: "아홉번째",
    problem: "재생된 곡에 대한 정보로 틀린 것은?",
    ex: [
      "노래 속 류님은 남친 시점이다.",
      "노래 티어표에서 등급을 받았다.",
      "재생 중인 버전 외에 아카펠라 버전도 있다.",
      "지금 재생되고 있는 버전은 기싸움 버전이다.",
    ],
    videoid: "tkpQfzhI39o",
  },
  {
    number: "열번째",
    problem: "다음 중 1절만 커버된 곡은?",
    ex: ["死神 (사신)", "Ch4nge", "Queen", "Drugs"],
  },
  {
    number: "열한번째",
    problem: "류님이 유튜브에 가장 처음 올린 커버곡은?",
    ex: [
      "디핵, PATEKO - OHAYO MY NIGHT",
      "애쉬 아일랜드 - 악몽",
      "아카이로 류 - 혼자 걷는 거리",
      "빈첸 - 바코드",
    ],
  },
  {
    number: "열두번째",
    problem: "다음 중 류님이 유튜브에서 내리고 싶다 한 곡이 아닌 곡은?",
    ex: [
      "恋愛サーキュレーション(연애 시뮬레이션)",
      "ぎゅっと(꼬옥)",
      "Can't Slow Me Down",
      "11:11",
    ],
  },
  {
    number: "열세번째",
    problem: "류님의 J-POP 채널 이름이 바뀐 후, 처음 올라온 곡은?",
    ex: ["Ignore", "Overdose", "サムライハート(사무라이 하트)", "好きだから｡(좋아하니까)"],
  },
  {
    number: "열네번째",
    problem: "다음 J-POP 커버곡 중 kuroi 채널로 올라온 곡이 아닌 곡은?",
    ex: ["Ch4nge", "シャンティ (샨티)", "Queen", "Overdose"],
  },
  {
    number: "열다섯번째",
    problem: "다음 중 류님이 커버한 곡이 아닌 곡은?",
    ex: ["딥상어 - X", "줍에이 - 주르륵", "(여자)아이들 - 톰보이", "양승호 - 지구멸망"],
  },
  {
    number: "열여섯번째",
    problem: "다음 중 류님이 듀엣으로 부른 곡이 아닌 곡은?",
    ex: ["ぎゅっと(꼬옥)", "지구멸망", "7%", "주르륵"],
  },
  {
    number: "열일곱번째",
    problem: "리레볼루션 노래컨텐츠 중 류님이 한 대사가 아닌 것은?",
    ex: ["이러다 다 죽어!", "자, 맛 좀 볼까?", "진짜 너무 어려워!!!", "슈릅"],
  },
  {
    number: "열여덟번째",
    problem:
      "다음 중 리레볼루션 커버곡 노래 제목과 류님 파트 가사가 맞지 않은 것은? ( 노래제목 - 가사 )",
    ex: [
      "好きだから(좋아하니까) - 아 어떻게 널 사랑하지 않아",
      "神のまにまに(신의 뜻대로) - 그렇게 고양이도 늑대도 고슴도치 상어도",
      "저주인형 - 잊을 수 없을 땐 가져야 하잖아",
      "CASE143 - 나의 속맘 다시 repeat",
    ],
  },
  {
    number: "열아홉번째",
    problem: "다음 중 류님이 노래 컨텐츠 속에서 마지막에 '사랑해' 라고 말한 곡은?",
    ex: [
      "고민중독",
      "ドーナツホール (도넛홀)",
      "ベテルギウス (베텔기우스)",
      "ダンスホール (댄스 홀)",
    ],
  },
  {
    number: "스무번째",
    problem:
      "류님은 트위치 한국 섭종으로 포인트 털이 중 포인트 목표를 통해 성공 시 「걘 아니야」를 커버하겠다고 하였습니다. 이 때, 목표 포인트는?",
    ex: ["1,500,000개", "1,000,000개", "1,400,000개", "1,300,000개"],
  },
  {
    number: "스물한번째",
    problem: "다음 중 류님의 커버곡 「7%」와 관련한 정보로 잘못된 것은?",
    ex: [
      "같이 듀엣한 윤단님이랑 이번에 처음한 듀엣곡이다.",
      "노래 개사를 류님이 직접하였다.",
      "크리스마스 기념으로 나온 곡이다.",
      "밖에 눈이 와서 예정보다 일찍 공개되었다.",
    ],
  },
  {
    number: "스물두번째",
    problem: "다음 중 류님이 직접 작사 혹은 개사를 한 곡이 아닌 것은?",
    ex: ["混沌ブギ (혼돈부기)", "アニマル (애니멀)", "踊 (춤)", "極楽浄土 (극락정토)"],
  },
  {
    number: "스물세번째",
    problem: "다음 중 류님 유튜브 재생목록 중 간단한 작업곡 에 포함되어있지 않은 곡은?",
    ex: ["무채색", "피해망상", "태극즈 사이퍼", "혼자 걷는 거리"],
  },
];

export const warningMessage: Array<String> = [
  "2024년 연말 기념 아카이로 류 노래 모의고사를 준비하였습니다.",
  "문제는 총 23개로, 1~9번까지는 듣기평가로 이뤄져 있습니다. 아이콘 클릭 시, 재생이 시작되며, 재생되지 않은 경우 한번 더 클릭해주세요.",
  "모든 문제는 류님의 나무위키, 생방송, 유튜브 를 기반으로 출제하였습니다.",
  "본 사이트는 PC 기준으로 제작되었기에 PC로 진행하시길 권장드립니다.",
  "모든 문제는 이전 문제로의 이동을 지원하지 않습니다. 뒤로가기를 할 경우, 홈으로 이동됨을 유의하여 주시길 바랍니다.",
  "사이트 버그 등에 대한 문제는 X(전 트위터)의 푸슝을 통해 문의하여 주시길 바랍니다.",
  "좋은 결과가 나오길 기원합니다! 재밌게 즐겨주세요!🤗",
];

export const number = [2, 0, 0, 2, "-", 1, 1, 0, 1];
